{"actions":[{"pauseBeforeRunning":false,"pauseWithoutShowingParameters":false,"customTitle":"Try to open Sampler.md","class":"WorkflowActionGetFileContents","parameters":{"inDropbox":false,"ifNotExists":0,"filename":"Sampler.md"}},{"pauseBeforeRunning":false,"pauseWithoutShowingParameters":false,"customTitle":"If Sampler.md already exists","class":"WorkflowActionCondition","parameters":{"comparisonType":1,"expression2":{"type":"advancedText","tokenRanges":{},"text":""},"expression1":{"type":"advancedText","tokenRanges":{"{0, 1}":"Input"},"text":"?"}}},{"pauseBeforeRunning":false,"pauseWithoutShowingParameters":false,"customTitle":"","class":"WorkflowActionShowAlert","parameters":{"button2Value":{"type":"advancedText","tokenRanges":{},"text":""},"button1Title":"","button1Value":{"type":"advancedText","tokenRanges":{"{0, 1}":"Input"},"text":"?"},"showCancelButton":false,"title":"File sampler.md already exists","message":{"type":"advancedText","tokenRanges":{},"text":"You only have to run this workflow once, to create file sampler.md. If you want to run the workflow again, delete Sampler.md first"},"button3Title":"","button3Value":{"type":"advancedText","tokenRanges":{},"text":""},"button2Title":""}},{"pauseBeforeRunning":false,"pauseWithoutShowingParameters":false,"customTitle":"","class":"WorkflowActionStopWorkflow","parameters":{"showHUD":false,"HUDTitle":""}},{"pauseBeforeRunning":false,"pauseWithoutShowingParameters":false,"customTitle":"","class":"WorkflowActionConditionEnd","parameters":{}},{"pauseBeforeRunning":false,"pauseWithoutShowingParameters":false,"customTitle":"Get the markdown text for Sampler.md","class":"WorkflowActionRunScript","parameters":{"script":"#coding: utf-8\nimport workflow\n\nmd = \"\"\"# Sampler\nUse this Markdown document while developing style sheets. It has the look of a real document and has examples of all [Python Markdown syntax](http:\/\/pythonhosted.org\/Markdown\/index.html) plus the Tables extension. If you use other extensions, you can add examples at the end. Peter Hopcroft, January 2014\n\n## Examples of links\nThe text comes from the out-of-copyright book: 'The American Practical Brewer and Tanner', 1815, by Joseph Coppinger. I got it from a [Gutenberg EBook](http:\/\/www.gutenberg.org\/ebooks\/20663) and I am reusing it under the terms of the [their license](http:\/\/www.gutenberg.org\/wiki\/Gutenberg:The_Project_Gutenberg_License).\n\n>To offer an apology for giving these subjects a place in this publication, seem wholly unnecessary, when their importance is considered.\r\n\r# Examples of basic markdown syntax\n\n## Examples of paragraphs\n\n### Long paragraphs and inline elements\nBrewing, in every country, whose soil and climate are congenial to the production of the raw materials, should be ranked among the first objects of its domestic and political economy. If any person doubt the truth of this position, I have only to request him to cast an eye on England, where the brewing capital is estimated at more than fifteen millions sterling; and the gross annual revenue, arising from this capital, at seven million five hundred thousand pounds sterling, including the hop, malt, and extract duties. Notwithstanding this enormous excise of 50 per cent. on the brewing capital, what immense fortunes have been made, and are daily making, in that country, as well as in Ireland and Scotland, by the intelligent and judicious practice of this more than useful art.\n\nParagraph with inline elements. Yet how much *stronger* inducements for similar establishments in this country, where we have no duty on the raw **materials**, or the extract; and where the `important` article of hops is raised in as high perfection as in any part of Europe, and often for one third of the price paid in England. But a *still more important consideration is the health and morals of our population*, which appears to be essentially connected with the progress of the brewing trade. **In proof of this assertion, I will beg leave to state a well known fact**; which is, that in proportion as the consumption of malt liquors have increased in our large towns and cities, in that proportion `has the health of our fellow citizens improved`, and epidemics and intermittents, become less frequent.\n\n### More paragraphs\nThe farmer and the merchant will alike find their account in encouraging and improving the produce of the brewery.\n\nThe same observation holds good as respects the country, where it is well known that those families that brew their own beer, and make a free use of it through the summer are, in general, all healthy, and preserve their colour; whilst their less fortunate neighbours, who do not use beer at all, are devoured by fevers and intermittents. These facts will be less doubted, when it is known that yest, properly administered, has been found singularly successful in the cure of fevers. This the practice of the Rev. Doctor Townsend, in England, places beyond all doubt, where he states, that in fifty fever cases that occurred in his own parish, (some of which were of the most malignant kind,) he only missed a cure in two or three, by administering yest. Having considered the produce of the brewery as it is connected with health, we may, with equal propriety, say it is not less so with morals.\n\n### Short paragraphs\nThe farmer can raise no crop that will pay him better than hops; as, under proper management, he may reasonably expect to clear, of a good year, one hundred dollars per acre. \n\nBarley will also prove a good crop, if proper attention be paid to seed, soil, and time of sowing.\n\nThe merchant will alike find his account in encouraging the brewery, from the many advantages derivable from an extensive export of its produce to the East and West Indies, South America, the Brazils.\n\n## Examples of lists\nSky, or water coolers, in general, are:\n\n-\tsquare vessels\n-\tof the best two inch pine plank\n-\tproperly jointed\n-\tfrom twenty to twenty-five feet square.\n\nBut particularly to Russia, where good beer is in great demand; large quantities are annually sent there from England, at a much higher rate, it may be presumed, than we could afford to supply them from this country.\n\n1.\tSince writing the Preface, I have been induced to make an addition to this little work, in order to increase its usefulness, by giving the French mode of tanning, as practised by the famous Mr. Seguine.\n\n\tOf such importance did the Academy of Arts and Sciences at Paris consider this improvement, that they thought it worth while to appoint a committee of their own members to go down to one of the provinces where this gentleman resides, and there, on the spot, superintend his operations, which they did with minute attention; and it is from the journal of their reports to the academy, that the different processes of tanning leather in this ingenious artist's way are here given:\n\n\t-\tBrewing without boiling.\r\n\t-\tBrewing strong beer.\r\n\t-\tA simple method of giving new beer.\r\n\t-\tA simple method of preventing beer bursting the bottle.\r\n\n2. \tThis single advantage alone so forcibly recommends its adoption, particularly in a country like ours, where capital is scarce, that further comment is unnecessary. I have also added the Bordeaux method of making and preparing claret wine for shipping, as practised in that city and its vicinity; which practice may possibly hereafter be successfully applied to the red wines of this country.\n3. \tAs that territory is now in our possession, and its soil and climate peculiarly favourable to the growth of the grape, which is indigenous there, may it not be an object well worth the attention of our government, to encourage and improve the growth of the wine in that section of the union; which wise measure would, probably, in a few years, supply our own consumption, and leave a considerable surplus for exportation. \n\r\nAll these considerations united seem forcibly to recommend giving the breweries of the United States every possible encouragement and extension. Here, it is but justice to state, that the brewers of New-York deserve much credit for the high improvement they have made in the quality of their malt liquors within a few years, which seem to justify the hope that they will continue these advances to excellence, until they realise the opinion of Combrune and others, that it is possible to produce a malt wine.\r\n\n## Examples of blockquotes\nA new and economical construction of vats for keeping beer, which, in this way, may be rendered fire proof, whilst at the same time possessing the temperature of the best cellars, although above ground.\n\r>The best plan of a well-constructed brewery I conceive to be that of a hollow, or oblong square.\n\nA description of the form and plan of a brewery, distribution of the vessels; the most judicious and convenient manner of placing them, with a view to economy, cleanliness, and effect.\n\n>The best plan of a well-constructed brewery I conceive to be that of a hollow, or oblong square, where all is enclosed by one or two gateways, (the latter the most complete,) parallel to each other. The first gateway, forming the brewery entrance, to pass through the dwelling house; the second, or corresponding gateway, to pass through the opposite side of the square, into an outer yard, well enclosed with walls and sheds, containing cooper's shop, &c. where all the empty casks might be securely preserved from the injury of wind and weather. \n\n>>The sides of these coolers are generally raised from eighteen inches to two feet; in Europe they are generally leaded on their inside, but this expense may be saved, if they are properly made at first.\n\n>This yard should be further sufficiently large to afford room for a hay reek, firewood, dung, &c. \n\r\nCleanliness being as essential in the brewery as in the dairy, it is of th greatest importance, never to lose sight of it in every part of the operations, and particularly in selecting the ground and soil to place a brewery on. \n\n## Code blocks\nThe situation to be preferred should be an elevated one, and the soil either sand or gravel.\n\n\tIt is of great importance in the preservation of\n\tbeer that the cellars be dry.\n\nPumping by a hand or a horse power is a poor substitute, as by this means (which we find too common in breweries) the washings of the cellars have time to become putrid.\n\t\n\tThis is a serious evil, and should in all cases,\n\tas much as possible, be avoided. It is true, there \n\tare times, when a choice of situation cannot be made; \n\tin that case, circumstances must be submitted to, \n\tand people do the best they can.\n\t\n\tThe cellars and coolers of the breweries in this \n\tcountry should have a northern aspect, and the\n\tcellars principally ventilated from east to west.\n\tThe windows on the south side of cellars should be\n\talways close shut in summer, and only occasionally\n\topened in winter; the floors of cellars should be\n\tpaved with either tile or brick, these being more\n\tsusceptible of being kept clean than either pavement\n\tor flags.\n\nCleanliness being as essential in the brewery as in the dairy, it is of th greatest importance, never to lose sight of it in every part of the operations, and particularly in selecting the ground and soil to place a brewery on.\n\n## Horizontal rule\nOf such importance did the Academy of Arts and Sciences at Paris consider this improvement, that they thought it worth while to appoint a committee of their own members to go down to one of the provinces where this gentleman resides, and there, on the spot, superintend his operations, which they did with minute attention; and it is from the journal of their reports to the academy, that the different processes of tanning leather in this ingenious artist's way are here given.\n\n---\n\nAll these considerations united seem forcibly to recommend giving the breweries of the United States every possible encouragement and extension. Here, it is but justice to state, that the brewers of New-York deserve much credit for the high improvement they have made in the quality of their malt liquors within a few years, which seem to justify the hope that they will continue these advances to excellence, until they realise the opinion of Combrune and others, that it is possible to produce a malt wine.\r\n\n## Images\n\n![Insert link to your own large image here](http:\/\/example.com\/test.jpg \"Optional title\")\n\nA description of the form and plan of a brewery, distribution of the vessels; the most judicious and convenient manner of placing them, with an inline image ![insert link to your own small image here](http:\/\/example.com\/test.jpg) with a view to cleanliness, and effect.\n\n\n# Extensions to basic markdown\n\n## Tables\nA description of the form and plan of a brewery, distribution of the vessels; the most judicious and convenient manner of placing them, with a view to economy, cleanliness, and effect.\n\nCode | Room\n-------|------\nA  | Malt House\nB  |Brewery office\nC  |Cellars\nD  | Sky cooler\n\nMalt house, the best construction of, with proper barley lofts, dropping room, and flooring, how, and in what manner made, and best likely to last.\r\rCode | Room | Notes\n-------|-------|-------\nA  | Malt House | The dwelling house, vat house, and working store, to form one side of the brewery. \nB  |Brewery office  | Place in the passage of the outer gateway, so that every thing going in and out might be seen by those who are in the office.\nC  |Cellars | If these be under ground, it would be very desirable to have them kept sweet and clean by properly constructed sewers\nD  | Sky cooler | The sky cooler is, generally, the most elevated vessel in the brewery, and when properly constructed, is of great importance in facilitating both brewing and malting operations, as it usually supplies the whole quantity of water wanted in both.\n\rThe best position for placing a brewery and malt house, also the best aspect with different arrangements of the vessels.\n\n---\n\n\n\"\"\"\n\nworkflow.set_output(md)\n"}},{"pauseBeforeRunning":false,"pauseWithoutShowingParameters":false,"customTitle":"Write the markdown text to Sampler.md","class":"WorkflowActionSetFileContents","parameters":{"inDropbox":false,"filename":"Sampler.md","ifNotExists":0,"text":{"type":"advancedText","tokenRanges":{"{0, 1}":"Input"},"text":"?"}}},{"pauseBeforeRunning":false,"pauseWithoutShowingParameters":false,"customTitle":"","class":"WorkflowActionShowAlert","parameters":{"button2Value":{"type":"advancedText","tokenRanges":{},"text":""},"button1Title":"","button1Value":{"type":"advancedText","tokenRanges":{"{0, 1}":"Input"},"text":"?"},"showCancelButton":false,"title":"File Sampler.md has been written","message":{"type":"advancedText","tokenRanges":{},"text":"Look for the places in Sampler.md where there are images and add links to your own images.\n\nYou don't need this workflow again, so you can delete it."},"button3Title":"","button3Value":{"type":"advancedText","tokenRanges":{},"text":""},"button2Title":""}}]}